Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector Methods
The AnalysisObjectSelector type exposes the following members.
Methods
Name | Description
GetSelectedObjects
 Get the analysis objects selected in model views.
SetSelectedObjects
 Set analysis objects as selected in model views.
Top
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis.UI Namespace